In [2]:
import pandas as pd
import numpy as np

In [3]:
solar_df = pd.read_csv('../Data/solar.csv')

In [152]:
solar_df

,Unnamed: 0,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
0,0,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:30:00,7.8,6.8,5.5
1,1,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:45:00,7.8,6.8,5.5
2,2,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:00:00,7.8,6.8,5.5
3,3,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:15:00,7.8,6.8,5.5
4,4,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:30:00,7.8,6.8,5.5
...,...,...,...,...,...,...,...,...,...,...,...,...
148805,148805,2020-09-30,29.67,6.68,6.34,5.49,4.55,25.28,22:45:00,13.0,12.6,12.8
148806,148806,2020-09-30,29.94,6.71,6.39,5.65,4.57,25.30,23:00:00,13.0,12.6,12.8
148807,148807,2020-09-30,34.02,8.13,7.71,6.83,5.32,28.62,23:15:00,13.0,12.6,12.8
148808,148808,2020-09-30,38.10,9.55,9.03,8.02,6.08,31.94,23:30:00,13.0,12.6,12.8
148809,148809,2020-09-30,39.88,10.12,9.67,8.62,6.33,32.92,23:45:00,13.0,12.6,12.8

In [182]:
solar_df1 = solar_df[133000:134000]
solar_df1

,Unnamed: 0,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
133000,133000,2020-04-19,NaN,7.63,3.50,1.60,1.85,0.0,07:30:00,11.3,11.3,11.4
133001,133001,2020-04-19,NaN,7.63,3.50,1.59,1.85,0.0,07:45:00,11.3,11.3,11.4
133002,133002,2020-04-19,NaN,7.63,3.50,1.59,1.85,0.0,08:00:00,11.3,11.3,11.4
133003,133003,2020-04-19,NaN,7.63,3.50,1.59,1.85,0.0,08:15:00,11.3,11.3,11.4
133004,133004,2020-04-19,NaN,7.63,3.50,1.59,1.85,0.0,08:30:00,11.3,11.3,11.4
...,...,...,...,...,...,...,...,...,...,...,...,...
133995,133995,2020-04-29,0.0,7.62,3.92,1.18,1.54,0.0,16:15:00,3.6,2.6,2.2
133996,133996,2020-04-29,0.0,7.62,3.92,1.17,1.54,0.0,16:30:00,3.6,2.6,2.2
133997,133997,2020-04-29,0.0,7.62,3.92,1.17,1.54,0.0,16:45:00,3.6,2.6,2.2
133998,133998,2020-04-29,0.0,7.62,3.92,1.17,1.54,0.0,17:00:00,3.6,2.6,2.2
133999,133999,2020-04-29,0.0,7.62,3.92,1.17,1.54,0.0,17:15:00,3.6,2.6,2.2

In [175]:
solar_df1.iat[1,0]

133001

In [185]:
solar_df.drop('Unnamed: 0',axis = 1)

,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
0,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:30:00,7.8,6.8,5.5
1,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:45:00,7.8,6.8,5.5
2,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:00:00,7.8,6.8,5.5
3,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:15:00,7.8,6.8,5.5
4,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:30:00,7.8,6.8,5.5
...,...,...,...,...,...,...,...,...,...,...,...
148805,2020-09-30,29.67,6.68,6.34,5.49,4.55,25.28,22:45:00,13.0,12.6,12.8
148806,2020-09-30,29.94,6.71,6.39,5.65,4.57,25.30,23:00:00,13.0,12.6,12.8
148807,2020-09-30,34.02,8.13,7.71,6.83,5.32,28.62,23:15:00,13.0,12.6,12.8
148808,2020-09-30,38.10,9.55,9.03,8.02,6.08,31.94,23:30:00,13.0,12.6,12.8
148809,2020-09-30,39.88,10.12,9.67,8.62,6.33,32.92,23:45:00,13.0,12.6,12.8

In [190]:
def removenull(df):
    rowsremove = []
    k = 0
    for i in range(len(df)): #go through each row
        for j in range(1,len(df.columns)): # go through each column
            if type(df.iat[i,j]) != str:
                if df.iat[i,j] <=100:
                    k = 2
                else:
                    rowsremove.append(i)
    rowsremove = list(dict.fromkeys(rowsremove))
    return rowsremove

In [191]:
solar_df = solar_df.drop(removenull(solar_df), axis = 0)

In [192]:
solar_df

,Unnamed: 0,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
133602,133602,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:00:00,10.4,10.6,10.2
133603,133603,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:15:00,10.4,10.6,10.2
133604,133604,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:30:00,10.4,10.6,10.2
133605,133605,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:45:00,10.4,10.6,10.2
133606,133606,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,15:00:00,10.4,10.6,10.2
...,...,...,...,...,...,...,...,...,...,...,...,...
148805,148805,2020-09-30,29.67,6.68,6.34,5.49,4.55,25.28,22:45:00,13.0,12.6,12.8
148806,148806,2020-09-30,29.94,6.71,6.39,5.65,4.57,25.30,23:00:00,13.0,12.6,12.8
148807,148807,2020-09-30,34.02,8.13,7.71,6.83,5.32,28.62,23:15:00,13.0,12.6,12.8
148808,148808,2020-09-30,38.10,9.55,9.03,8.02,6.08,31.94,23:30:00,13.0,12.6,12.8
148809,148809,2020-09-30,39.88,10.12,9.67,8.62,6.33,32.92,23:45:00,13.0,12.6,12.8

In [193]:
solar_df.describe()

,Unnamed: 0,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,olympic_solar,oakleigh_solar,moorabbin_solar
count,15208.000000,15208.000000,15208.000000,15208.000000,15208.000000,15208.000000,15208.000000,15208.000000,15208.000000,15208.000000
mean,141205.500000,4.386435,2.587612,1.903342,1.324001,0.970571,4.537017,9.674066,9.438506,9.652078
std,4390.315782,8.858768,3.363009,2.547754,2.205833,1.438830,8.436786,3.582926,3.692676,3.538517
min,133602.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2.600000,2.600000,2.200000
25%,137403.750000,0.010000,0.000000,0.000000,0.000000,0.000000,0.000000,7.400000,7.000000,7.200000
50%,141205.500000,0.010000,0.160000,0.120000,0.100000,0.070000,0.000000,9.100000,9.100000,9.100000
75%,145007.250000,4.130000,6.142500,3.980000,1.340000,1.440000,5.250000,11.300000,11.300000,11.400000
max,148809.000000,50.410000,12.680000,12.910000,11.040000,7.530000,39.570000,20.900000,19.300000,20.600000

In [195]:
solar_df.to_csv('solar.csv')